{
  "CELD": [
    "[5811] An Introduction of Orbis Hong Kong cum Briefing Session for Orbis Future Vision Leader Program 2025/26",
    "[5820] Develop Your Leadership in the Hong Kong Air Cadet Corps - Officer Trainee Training Programme",
    "[5828] C. Connects——Volunteer Training and Elderly Service",
    "[5833] Chinese YMCA – Fluid Painting Workshop",
    "[5836] Hong Kong Red Cross Humanitarian Workshop: From Misunderstanding to Understanding",
    "[5838] Hong Kong Red Cross Humanitarian Workshop: A Journey of Empathy, Reflection and Change",
    "[5840] Walking into the Life of Sub-divided Flats",
    "[6088] Global Inclusive Leadership Programme (Certificate Programme)",
    "[5736] Hong Kong Hiking Trails x Leave No Trace Talk",
    "[5737] Handcrafted Trail x Green Mountaineering Day @ Mui Tsz Lam",
    "[5741] Science Unit Seminar Series – Freshwater Ecosystems: Lifeblood of Our Planet",
    "[5742] Science Unit Seminar Series – Citizen Science in Education: Engaging Students with Real Research",
    "[5743] Science Unit Seminar Series – From Lab to Marine: Science-Driven Conservation of the Ocean",
    "[5744] Science Unit Seminar Series – Coral Symbiosis: The Secret Engine of Reef Survival",
    "[5745] Science Unit Seminar Series – Understanding Without Truth: Can Science Explain the World Without True Theories?"
  ],
  "IED": [
    "[5920] Understanding Current Job Market in Digital and Innovative Era for Career Success",
    "[5925] Career Workshop: Applying MBTI Assessment to Your Career Exploration & Planning",
    "[5948] Career Workshop: Practical Skills for Aptitude Test",
    "[5949] Career Workshop: Essential Tips for Assessment Centre/Activity-based Assessment/Group Discussion/Case Studies",
    "[5950] Career Workshop: Powerful Individual/Group Interview Skills",
    "[5951] Career Workshop: Effective Video/Phone Interview Skills",
    "[5952] Career Talk: Teaching Profession and Qualifications in Hong Kong",
    "[6079] Toastmasters Training for Public Speaking",
    "[5962] Pre-Internship Training Programme (PTP): Internship Application: CV writing (creating a LinkedIn Profile)",
    "[5969] Pre-Internship Training Programme (PTP): Interview Preparation - Responding to Interview Questions",
    "[6008] Pre-Internship Training Programme (PTP): Interview Preparation - Introduction to Case Analysis",
    "[6009] Pre-Internship Training Programme (PTP): Internship Excellence - Business Practices",
    "[6010] Pre-Internship Training Programme (PTP): Internship Excellence: Safeguard Yourself from Employment Traps",
    "[6013] Pre-Internship Training Programme (PTP): Internship Excellence: Work Ethics and Integrity",
    "[6016] Career Workshop: Applying TTI DISC Assessment to Your Career Exploration & Planning",
    "[6018] Career Talk: A Day at CPA Firm",
    "[6021] Career Talk: SDG Series - The Impact of ESG (Environmental, Social, Governance) on Shaping Future Landscape of Careers",
    "[6023] Career Talk: SDG Series - Career Opportunities and The Application of ESG (Environmental, Social, Governance) in Business/ Green & Sustainable Finance",
    "[6026] Financial Planning cum MPF Workshop",
    "[6027] Career Workshop: Applying Self-Directed Search Assessment to Your Career Exploration & Planning",
    "[6030] Alumni Sharing: Recruitment Process and Interview Tips for Government Executive Officer/Related Officers",
    "[6032] Mock Interview for HKSAR Government Officers",
    "[6034] From Risk to Opportunity: AI’s Impact on Next Generation",
    "[6036] Exploring the Accounting Profession in Hong Kong",
    "[6037] A Social Media Insider’s Guide to Mainland KOL Economy and Traffic Secrets",
    "[6039] Beyond the Degree: Designing a Career Without Borders",
    "[6041] Life Design for Work",
    "[6047] Career Development in Sports and Recreation in Hong Kong",
    "[6051] Career Talk: Artificial Intelligence - A New Era for Family Offices",
    "[6052] Exploring New Horizons: Opportunities in Art and Culture Industry",
    "[6053] Hong Kong IT Entrepreneur: Way to Success",
    "[6055] Direction Finder: A Fun Guide to Exploring Your Career Options",
    "[6056] Networking in Action: Put It into Real",
    "[6057] Understanding Yourself with Personality Dimension - Career Focused",
    "[6094] AI Tools Mastery Workshop: Practical Skills for Study and Work",
    "[5710] Arduino: Beginner Level",
    "[5711] Arduino: Intermediate Level",
    "[5712] 3D Modelling & 3D Printing: Beginner Level",
    "[5713] 3D Modelling and 3D Printing: Intermediate Level",
    "[5728] Drone Technology: Beginner Level",
    "[5730] Drone Technology: Intermediate Level",
    "[5731] Virtual Reality: Beginner Level",
    "[5732] Virtual Reality: Intermediate Level",
    "[5733] Artificial Intelligence: Beginner Level",
    "[5734] Artificial Intelligence: Intermediate Level",
    "[5735] Prompt Engineering"
  ],
  "SEW": [
    "[5812] Regulate with Art: An Experiential Workshop about Art and Emotional Awareness",
    "[5813] Creative Pathways to Self: An Experiential Arts-Based Workshop for Self-Awareness",
    "[5816] Tune In & Wind Down: Music-Assisted Strategies for Stress and Rest",
    "[5824] Managing My Wealth: Smart Spending and Healthy Financial Planning",
    "[5827] Thriving Under Pressure: Stress Management for University Success",
    "[5832] Cultivating Happiness in University Life",
    "[5835] Overcoming Imposter Syndrome: Embrace Your Worth and Achieve Your Potential",
    "[5837] Creating a Safe and Respectful Campus: Preventing Sexual Harassment at University",
    "[5839] Level Up Your Learning: Essential Study Strategies for University Success",
    "[5841] Ace the Test: Ultimate Exam Prep Workshop for University Success",
    "[5843] Stress-Proof 101: Level Up Your Resilience Superpowers",
    "[5844] Snooze & Thrive: Crack the Code to Better Sleep (No Melatonin Required!)",
    "[5845] Stress Relief Tips: Learning Resilience from Stories of Recovery",
    "[5847] Strategies to Free Yourself from Self-Doubt",
    "[5849] Understanding Self-Worth Through Online Social Interaction"
  ],
  "PFW": [
    "[5750] Badminton",
    "[5754] Basketball",
    "[5755] Soccer",
    "[5756] Squash",
    "[5761] Tennis",
    "[5763] Volleyball",
    "[5766] Woodball",
    "[5760] Table Tennis",
    "[5769] Massage Ball/ Foam Roller Relaxing Exercise",
    "[5767] Bodybuilding",
    "[5772] Yoga",
    "[5771] Slim Yoga",
    "[5768] Gentle Stretching",
    "[5777] Boxing",
    "[5778] Fencing",
    "[5779] Judo",
    "[5780] Karate",
    "[5781] Muay-Thai Boxing",
    "[5782] Taekwondo",
    "[5784] Ving Tsun",
    "[5787] Kpop Dance",
    "[5786] Hip Hop Dance",
    "[5791] Archery Workshop",
    "[5792] Health Talk: Introduction to nutrition facts",
    "[5793] Fitness Talk: No gym room? No problem!\n ⁠Effective exercises in the hall room",
    "[5794] Fitness Talk: Busy on your campus life? No excuse. Effective exercise plans with short time.",
    "[5789] Introduction to First Aid Course (3hrs)"
  ],
  "AES": [
    "[6060] Culinary Aesthetics - Exploring Life Through Hong Kong's Food Culture",
    "[6061] Hong Kong Calligraphy Archive - Ink & the City",
    "[5716] “Meet the Hong Kong Maestro”:  Music of Traditional Chinese Theatre (Chinese Opera) & Traditional\nCantonese Narrative Singing",
    "[6059] “Meet the Hong Kong Maestro”:  \nSharing and Demonstration of Paper Crafting Technique",
    "[6073] Fundamental Chinese Calligraphy - Xing Shu & Kai Shu",
    "[6074] Fundamental Chinese Calligraphy - Hard Pen",
    "[6075] Chinese Painting (Lingnan School of Painting) - Class I",
    "[6076] Chinese Painting (Lingnan School of Painting) - Class II",
    "[5714] Sun Tzu: The Game of Go and Strategy",
    "[6065] Theatre Aesthetic: Explore the World from Different Perspectives",
    "[6068] Conservation Professionals - Restoration of Asian Artifacts and Antiquities",
    "[6099] Gen Z Music New Generationc"
  ],
  "RE": [
    "[5990] Green Ambassadors @ Student Hostels Programme - Workshop on Planting and Sowing",
    "[5992] Green Ambassadors @ Student Hostels Programme - Organic Solutions for Food Waste",
    "[5994] Green Ambassadors @ Student Hostels Programme - Guided Tour to Bioloop",
    "[5996] Hostel Entrepreneurship Laboratory - Sustainable Development Goals - gamified!",
    "[5997] Hostel Entrepreneurship Laboratory - Ideation through Design Thinking",
    "[5981] Hiking at Tuen Mun Trail: Lam Tei Reservoir",
    "[5998] Hostel Entrepreneurship Laboratory - Lean Canvas",
    "[5982] Lingnan Stargazer",
    "[5983] Healthy Me, Healthy Planet - Korean Cuisine Workshop",
    "[5999] Hostel Entrepreneurship Laboratory - The Art of Pitching",
    "[6000] Hostel Entrepreneurship Laboratory - Final Pitch",
    "[5848] How Do You Say It in English?",
    "[5850] Latin Dance Workshop",
    "[5851] Cantonese Workshop (Hostel Context)",
    "[5852] Cantonese Workshop (Campus Context)",
    "[5853] Film Screening: A Land Imagined (2018), Directed by Yeo Siew Hua",
    "[5855] Managing Money in University - Tips for Success and Support",
    "[5860] AI to 3D Printing: Enhance Your Hostel Life with Innovative Prototypes",
    "[5865] Mindful Calligraphy: Exploring The Heart Sutra",
    "[5866] Navigating the Skies: Career Development in the Air Cargo Industry",
    "[5868] Sustainable Development in Residential Hostel",
    "[5870] Visually Impaired Stargazing Experience",
    "[5871] Design Thinking Workshop for Hostel Residents with AI Elements",
    "[5873] PNEC: \"The Earth is Burning\" Eat. Play.Workshop",
    "[6084] Mindfulness: Build Your Dream",
    "[5882] Lonely Planet: A Solitary Journey Through Central Asia",
    "[5884] The \"Werewolf Game\" Theory",
    "[5885] Welcome Party for Non-local Residents",
    "[5887] Upcycled Denim Key Chain Workshop",
    "[6082] English Public Speaking Workshop",
    "[6083] Movie Sharing",
    "[6038] Mid-Autumn Festival Lantern Workshop",
    "[6044] Explore Meditation and Vegetarian Diet for Good Health and Wellbeing: Visit to ISKCON Hong Kong",
    "[6069] Get Ready for LCC1010 Oral Exam: Prep Workshop",
    "[6070] Get Ready for LCC2010 Oral Exam: Prep Workshop",
    "[6072] Meeting with Warden",
    "[5892] Painting Workshop: Water Colour Painting",
    "[5893] 3D Print Workshop: Basic 3D Modelling & Printing Workshop",
    "[5894] Camera in Any Form: Make Your Own Pinhole Camera Workshop",
    "[5895] PSC Pronunciation Intensive Workshop:  Boost Your Score, Speak with Confidence!",
    "[5898] Movie Appreciation: Aquaman",
    "[5899] AI x Latte Art Coffee Workshop",
    "[5902] Your Dream Life: Music and Photo Therapy Workshop",
    "[5913] Let's Dance: Jive",
    "[5914] Christmas Handcraft Workshop",
    "[5916] Self-Understanding: Personality Dimensions (PD) Workshop",
    "[5917] Mindfulness: An Introduction to Breathing and Body Scan Meditation",
    "[5919] An Introduction to Breathing and Mindful Movement Practice",
    "[5921] Turning your Thesis into a Published Article: What Matters",
    "[5926] Cultivating Your Aesthetic: A Photography and Art Composition Workshop",
    "[5928] Tales of Solo Travel and Couchsurfing",
    "[5929] Career Café - Dialogue with Pioneers in Different Fields",
    "[5930] Food and Knowledge Production",
    "[5931] Workshop on Sleep Hygiene to Help You Sleep Better",
    "[5932] Group Fitness Exploration on Lingnan Campus",
    "[5933] Declutter Your Life: A Minimalist Journey",
    "[5941] Tips for Living Peacefully with Your Roommate",
    "[5942] Methods and Practices of AI-Assisted Scientific Dream Interpretation",
    "[5943] Sharing More about My Home Country",
    "[5944] Cinema Appreciation Night",
    "[5939] Natural Plant Dyeing Workshop",
    "[5940] Hiking around Lingnan",
    "[5945] In Books, We Meet"
  ]
}